---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsConnectorOffsetObsolete
source: html/9009af0a-616f-06b1-c282-bf79b42dfb01.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsConnectorOffsetObsolete Property

"Connector Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsConnectorOffsetObsolete { get; }
```